## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # kubernetes_ingress.cinema["wayofthesys.com"] will be created
+   resource "kubernetes_ingress" "cinema" {
+       id     = (known after apply)
+       status = (known after apply)

+       metadata {
+           annotations      = {
+               "cert-manager.io/cluster-issuer"       = "zerossl"
+               "ingress.kubernetes.io/rewrite-target" = "/"
+               "kubernetes.io/ingress.class"          = "nginx"
            }
+           generation       = (known after apply)
+           name             = "wayofthesys.com-cinema-ingress"
+           namespace        = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {

+           rule {
+               host = "wayofthesys.com"

+               http {
+                   path {
+                       path = "/"

+                       backend {
+                           service_name = "cinema-website"
+                           service_port = "80"
                        }
                    }
                }
            }

+           tls {
+               hosts       = [
+                   "wayofthesys.com",
                ]
+               secret_name = "wayofthesys-com-cinema-tls"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
